app/controllers/posts_controller.rb

def create
	@post = Post.new(params[:post])
	if @post.save
---
INSERT INTO "posts" ("created_at", "text", "title", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Mon, 10 Mar 2014 13:15:57 UTC +00:00], ["text", "world"], ["title", "hello"], ["updated_at", Mon, 10 Mar 2014 13:15:57 UTC +00:00]]